# pandas 기초

열(column) 중심 데이터 분석 API(Application Programming Interface)입니다.   
입력 데이터를 처리하고 분석하는 데 효과적인 도구이며,  
여러 ML 프레임워크에서도 Pandas 데이터 구조를 입력으로 지원합니다.   

https://pandas.pydata.org/pandas-docs/stable/index.html

<span style="color:blue">  
판다스 설치      
C:\Users\tina>conda install pandas             
</span>

## ● pandas 라이브러리의 Series 및 DataFrame 구조에 관한 소개

<span style="color:red"> 
Pandas에서 제공하는 Series 부분 코딩 
</span>

'1.4.2'

<span style="color:red"> 
Use Guide

https://pandas.pydata.org/docs/user_guide/dsintro.html#series  

위 사이트를 참고로 코딩  
    
</span>

In [2]:
# data 부분에 실제 의미있는 값이 들어가지 않아서 에러 발생

NameError: name 'data' is not defined

In [3]:
#numpy에서 제공하는 랜덤함수를 활용하여 데이터를 생성

a    0.148537
b   -0.373909
c    0.669655
d    1.017055
e    0.476869
dtype: float64

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
# index 생략가능

0   -0.207864
1   -0.292239
2    0.421513
3    1.023574
4   -1.768994
dtype: float64

RangeIndex(start=0, stop=5, step=1)

In [9]:
# 딕셔너리 타입으로 d 데이터 생성

<class 'dict'>
{'b': 1, 'a': 0, 'c': 2}

In [11]:
# 판단스 시리즈에 딕셔너리 타입을 전달 



# 딕셔너리에서 key 부분이 index, value 부분이 시리즈에서 데이터 값으로 생성

b    1
a    0
c    2
dtype: int64

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
# index값을 기준으로 데이터가 출력됨

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [15]:
# 참고 
# 딕셔너리 생성 


# 판다스 시리즈 생성

a    0.0
b    1.0
c    2.0
dtype: float64

In [16]:
# 참고 

# index 값을 기준으로 데이터 순서 변경

{'a': 0.0, 'b': 1.0, 'c': 2.0}
b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64
● type(dddd) <class 'pandas.core.series.Series'>

<span style="color:blue">
위와 같이 하나씩 코딩하면서 공부해야 함!!  
</span>

<span style="color:red"> 
Pandas에서 제공하는 DataFrame 부분 코딩 
</span>

In [18]:
# 딕셔너리 타입

dict

In [19]:
# 딕셔너리 타입으로 key : index value 가 있는 상태

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [20]:
# key : 열(columne)이름,  index : 행(row)이름으로 연결됨

In [21]:
# key : 열(columne)이름,  index : 행(row)이름으로 연결됨

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

{'one': a    1.0
b    2.0
c    3.0
dtype: float64, 'two': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [23]:
# 열(column)이름 변경 시도 (기존에 없었던 'three'를 설정하면 새로 생성되고 값은 NaN)

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [24]:
# 위에서 생성한 df는 처음 값을 유지하고 있음

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [25]:
# df의 index 부분 출력

Index(['a', 'b', 'c', 'd'], dtype='object')

In [26]:
# df의 column 부분 출력

Index(['one', 'two'], dtype='object')

<span style="color:red">  
Pandas의 기본 데이터 구조는 두 가지 클래스로 구현됩니다. 
    
1) Series는 하나의 "열"입니다.  
2) DataFrame은 행(row) 및 열(column)이 포함된 "관계형 데이터 테이블"이라고 생각할 수 있습니다.    
   DataFrame에는 하나 이상의 "Series"와 "각 Series의 index"부분이 포함됩니다. 
</span>

<span style="color:blue">
1) Series를 만드는 한 가지 방법은 Series 객체를 만드는 것입니다.  
</span>

In [27]:
#샌프란시스코, 새너제이, 새크라멘토 도시 이름

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [28]:
#샌프란시스코, 새너제이, 새크라멘토 도시 이름  


#샌프란시스코, 새너제이, 새크라멘토 도시에 해당하는 인구 수

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

0     852469
1    1015785
2     485199
dtype: int64

pandas.core.series.Series

In [32]:
#Python의 기본 산술 연산이 Series 원소별 연산에 적용됨

0     852.469
1    1015.785
2     485.199
dtype: float64

<span style="color:blue">
2) DataFrame 객체는 열(columbn) 이름과 매핑되는 문자열을 'dict'의 key에 전달하여 각각의 Series와 연결하여 만들 수 있다.
    
   Series의 길이가 일치하지 않는 경우, 누락된 값은 특수 NA/NaN 값으로 채워진다. 
</span>

In [33]:
 #딕셔너리 타입 활용 (주로 사용됨)

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

<span style="color:blue">
DataFrame 객체는  Series를 'list' 타입에 전달하면 아래와 같이 행(row) 단위로 생성된다. 
</span>

In [35]:
#리스트 타입 활용

In [36]:
# 행(row) 단위로 생성

               0         1           2
0  San Francisco  San Jose  Sacramento
1         852469   1015785      485199

<span style="color:blue">
DataFrame 에서는 DataFrame.columns 이용하여 열(columne) 이름을 리스트 타입으로 설정할 수 있다. 
</span>

In [37]:
#DataFrame에서는 DataFrame.columns 이용하여 열(column)이름 설정

          city_1    city_2      city_3
0  San Francisco  San Jose  Sacramento
1         852469   1015785      485199

<span style="color:blue">
DataFrame 에서는 DataFrame.index 이용하여 index 이름을 리스트 타입으로 설정할 수 있다.
</span>

In [39]:
#DataFrame에서는 DataFrame.index 이용하여 index 이름 설정

                   city_1    city_2      city_3
City_name   San Francisco  San Jose  Sacramento
Population         852469   1015785      485199